# IFCRange Properties

---
The IFCRange type exposes the following members.
| Name| Description
---|---|---
| End|  The ending value of the range.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Start|  The starting value of the range.
Top
#### Reference
IFCRange Class
Autodesk.Revit.DB.IFC Namespace